PX4/PX4-Autopilot/nuttx/configs/stm3240g-eval/src/up_lcd.c
      /* Power On sequence */

      stm3240g_writereg(LCD_REG_16,  0x0000); /* SAP, BT[3:0], AP, DSTB, SLP, STB */
      stm3240g_writereg(LCD_REG_17,  0x0000); /* DC1[2:0], DC0[2:0], VC[2:0] */
      stm3240g_writereg(LCD_REG_18,  0x0000); /* VREG1OUT voltage */
      stm3240g_writereg(LCD_REG_19,  0x0000); /* VDV[4:0] for VCOM amplitude */
      up_mdelay(200);                         /* Dis-charge capacitor power voltage (200ms) */

      stm3240g_writereg(LCD_REG_16,  0x17b0); /* SAP, BT[3:0], AP, DSTB, SLP, STB */
      stm3240g_writereg(LCD_REG_17,  0x0137); /* DC1[2:0], DC0[2:0], VC[2:0] */
      up_mdelay(50);

      stm3240g_writereg(LCD_REG_18,  0x0139); /* VREG1OUT voltage */
      up_mdelay(50);

      stm3240g_writereg(LCD_REG_19,  0x1d00); /* VDV[4:0] for VCOM amplitude */
      stm3240g_writereg(LCD_REG_41,  0x0013); /* VCM[4:0] for VCOMH */
      up_mdelay(50);

      stm3240g_writereg(LCD_REG_32,  0x0000); /* GRAM horizontal Address */
      stm3240g_writereg(LCD_REG_33,  0x0000); /* GRAM Vertical Address */

      /* Adjust the Gamma Curve */

      stm3240g_writereg(LCD_REG_48,  0x0006);
      stm3240g_writereg(LCD_REG_49,  0x0101);
      stm3240g_writereg(LCD_REG_50,  0x0003);
      stm3240g_writereg(LCD_REG_53,  0x0106);
      stm3240g_writereg(LCD_REG_54,  0x0b02);
      stm3240g_writereg(LCD_REG_55,  0x0302);
      stm3240g_writereg(LCD_REG_56,  0x0707);
      stm3240g_writereg(LCD_REG_57,  0x0007);
      stm3240g_writereg(LCD_REG_60,  0x0600);
      stm3240g_writereg(LCD_REG_61,  0x020b);
  
      /* Set GRAM area */

      stm3240g_writereg(LCD_REG_80,  0x0000); /* Horizontal GRAM Start Address */
      stm3240g_writereg(LCD_REG_81,  0x00ef); /* Horizontal GRAM End Address */
      stm3240g_writereg(LCD_REG_82,  0x0000); /* Vertical GRAM Start Address */
      stm3240g_writereg(LCD_REG_83,  0x013f); /* Vertical GRAM End Address */
      stm3240g_writereg(LCD_REG_96,  0x2700); /* Gate Scan Line */
      stm3240g_writereg(LCD_REG_97,  0x0001); /* NDL,VLE, REV */
      stm3240g_writereg(LCD_REG_106, 0x0000); /* Set scrolling line */

      /* Partial Display Control */

      stm3240g_writereg(LCD_REG_128, 0x0000);
      stm3240g_writereg(LCD_REG_129, 0x0000);
      stm3240g_writereg(LCD_REG_130, 0x0000);
      stm3240g_writereg(LCD_REG_131, 0x0000);
      stm3240g_writereg(LCD_REG_132, 0x0000);
      stm3240g_writereg(LCD_REG_133, 0x0000);

      /* Panel Control */

      stm3240g_writereg(LCD_REG_144, 0x0010);
      stm3240g_writereg(LCD_REG_146, 0x0000);
      stm3240g_writereg(LCD_REG_147, 0x0003);
      stm3240g_writereg(LCD_REG_149, 0x0110);
      stm3240g_writereg(LCD_REG_151, 0x0000);
      stm3240g_writereg(LCD_REG_152, 0x0000);

      /* Set GRAM write direction and BGR = 1
       *
       * I/D=01 (Horizontal : increment, Vertical : decrement)
       * AM=1 (address is updated in vertical writing direction)
       */

      stm3240g_writereg(LCD_REG_3, 0x1018);
      stm3240g_writereg(LCD_REG_7, 0);       /* Display off */
  }
  else
#endif 
#if !defined(CONFIG_STM32_ILI9325_DISABLE)
  if (id == ILI9325_ID)
    {
      g_lcddev.type = LCD_TYPE_ILI9325;
      lcddbg("LCD type: %d\n", g_lcddev.type);

      /* Start Initial Sequence */

      stm3240g_writereg(LCD_REG_0, 0x0001);  /* Start internal OSC. */
      stm3240g_writereg(LCD_REG_1, 0x0100);  /* Set SS and SM bit */
      stm3240g_writereg(LCD_REG_2, 0x0700);  /* Set 1 line inversion */
      stm3240g_writereg(LCD_REG_3, 0x1018);  /* Set GRAM write direction and BGR=1. */
      stm3240g_writereg(LCD_REG_4, 0x0000);  /* Resize register */
      stm3240g_writereg(LCD_REG_8, 0x0202);  /* Set the back porch and front porch */
      stm3240g_writereg(LCD_REG_9, 0x0000);  /* Set non-display area refresh cycle ISC[3:0] */
      stm3240g_writereg(LCD_REG_10, 0x0000); /* FMARK function */
      stm3240g_writereg(LCD_REG_12, 0x0000); /* RGB interface setting */
      stm3240g_writereg(LCD_REG_13, 0x0000); /* Frame marker Position */
      stm3240g_writereg(LCD_REG_15, 0x0000); /* RGB interface polarity */

      /* Power On sequence */

      stm3240g_writereg(LCD_REG_16, 0x0000); /* SAP, BT[3:0], AP, DSTB, SLP, STB */
      stm3240g_writereg(LCD_REG_17, 0x0000); /* DC1[2:0], DC0[2:0], VC[2:0] */
      stm3240g_writereg(LCD_REG_18, 0x0000); /* VREG1OUT voltage */
      stm3240g_writereg(LCD_REG_19, 0x0000); /* VDV[4:0] for VCOM amplitude */
      up_mdelay(200);                        /* Dis-charge capacitor power voltage (200ms) */
      stm3240g_writereg(LCD_REG_16, 0x17B0); /* SAP, BT[3:0], AP, DSTB, SLP, STB */
      stm3240g_writereg(LCD_REG_17, 0x0137); /* DC1[2:0], DC0[2:0], VC[2:0] */
      up_mdelay(50);                         /* Delay 50 ms */
      stm3240g_writereg(LCD_REG_18, 0x0139); /* VREG1OUT voltage */
      up_mdelay(50);                         /* Delay 50 ms */
      stm3240g_writereg(LCD_REG_19, 0x1d00); /* VDV[4:0] for VCOM amplitude */
      stm3240g_writereg(LCD_REG_41, 0x0013); /* VCM[4:0] for VCOMH */
      up_mdelay(50);                         /* Delay 50 ms */
      stm3240g_writereg(LCD_REG_32, 0x0000); /* GRAM horizontal Address */
      stm3240g_writereg(LCD_REG_33, 0x0000); /* GRAM Vertical Address */

      /* Adjust the Gamma Curve (ILI9325) */

      stm3240g_writereg(LCD_REG_48, 0x0007);
      stm3240g_writereg(LCD_REG_49, 0x0302);
      stm3240g_writereg(LCD_REG_50, 0x0105);
      stm3240g_writereg(LCD_REG_53, 0x0206);
      stm3240g_writereg(LCD_REG_54, 0x0808);
      stm3240g_writereg(LCD_REG_55, 0x0206);
      stm3240g_writereg(LCD_REG_56, 0x0504);
      stm3240g_writereg(LCD_REG_57, 0x0007);
      stm3240g_writereg(LCD_REG_60, 0x0105);
      stm3240g_writereg(LCD_REG_61, 0x0808);

      /* Set GRAM area */

      stm3240g_writereg(LCD_REG_80, 0x0000); /* Horizontal GRAM Start Address */
      stm3240g_writereg(LCD_REG_81, 0x00EF); /* Horizontal GRAM End Address */
      stm3240g_writereg(LCD_REG_82, 0x0000); /* Vertical GRAM Start Address */
      stm3240g_writereg(LCD_REG_83, 0x013F); /* Vertical GRAM End Address */

      stm3240g_writereg(LCD_REG_96,  0xA700); /* Gate Scan Line(GS=1, scan direction is G320~G1) */
      stm3240g_writereg(LCD_REG_97,  0x0001); /* NDL,VLE, REV */
      stm3240g_writereg(LCD_REG_106, 0x0000); /* set scrolling line */

      /* Partial Display Control */

      stm3240g_writereg(LCD_REG_128, 0x0000);
      stm3240g_writereg(LCD_REG_129, 0x0000);
      stm3240g_writereg(LCD_REG_130, 0x0000);
      stm3240g_writereg(LCD_REG_131, 0x0000);
      stm3240g_writereg(LCD_REG_132, 0x0000);
      stm3240g_writereg(LCD_REG_133, 0x0000);

      /* Panel Control */

      stm3240g_writereg(LCD_REG_144, 0x0010);
      stm3240g_writereg(LCD_REG_146, 0x0000);
      stm3240g_writereg(LCD_REG_147, 0x0003);
      stm3240g_writereg(LCD_REG_149, 0x0110);
      stm3240g_writereg(LCD_REG_151, 0x0000);
      stm3240g_writereg(LCD_REG_152, 0x0000);

      /* set GRAM write direction and BGR = 1 */
      /* I/D=00 (Horizontal : increment, Vertical : decrement) */
      /* AM=1 (address is updated in vertical writing direction) */

      stm3240g_writereg(LCD_REG_3, 0x1018);

      stm3240g_writereg(LCD_REG_7, 0x0); /* display off */ 

#else
      lcddbg("Unsupported LCD type\n");
#endif
}

 /**************************************************************************************
 * Public Functions
 **************************************************************************************/

/**************************************************************************************
 * Name:  up_lcdinitialize
 *
 * Description:
 *   Initialize the LCD video hardware.  The initial state of the LCD is fully
 *   initialized, display memory cleared, and the LCD ready to use, but with the power
 *   setting at 0 (full off).
 *
 **************************************************************************************/

int up_lcdinitialize(void)
{
  lcdvdbg("Initializing\n");

