PX4/PX4-Autopilot/nuttx/configs/stm3240g-eval/src/up_lcd.c
  /* Configure GPIO pins and configure the FSMC to support the LCD */

  stm32_selectlcd();

  /* Configure and enable LCD */

  up_mdelay(50);
  stm3240g_lcdinitialize();

  /* Clear the display (setting it to the color 0=black) */

  stm3240g_lcdclear(0);

  /* Turn the display off */

  stm3240g_poweroff();
  return OK;
}

/**************************************************************************************
 * Name:  up_lcdgetdev
 *
 * Description:
 *   Return a a reference to the LCD object for the specified LCD.  This allows support
 *   for multiple LCD devices.
 *
 **************************************************************************************/

FAR struct lcd_dev_s *up_lcdgetdev(int lcddev)
{
  DEBUGASSERT(lcddev == 0);
  return &g_lcddev.dev;
}

/**************************************************************************************
 * Name:  up_lcduninitialize
 *
 * Description:
 *   Unitialize the LCD support
 *
 **************************************************************************************/

void up_lcduninitialize(void)
{
  stm3240g_poweroff();
  stm32_deselectlcd();
}

/**************************************************************************************
 * Name:  stm3240g_lcdclear
 *
 * Description:
 *   This is a non-standard LCD interface just for the stm3240g-EVAL board.  Because
 *   of the various rotations, clearing the display in the normal way by writing a
 *   sequences of runs that covers the entire display can be very slow.  Here the
 *   dispaly is cleared by simply setting all GRAM memory to the specified color.
 *
 **************************************************************************************/

void stm3240g_lcdclear(uint16_t color)
{
  uint32_t i = 0;
  
  stm3240g_setcursor(0, STM3240G_XRES-1); 
  stm3240g_gramselect();
  for (i = 0; i < STM3240G_XRES * STM3240G_YRES; i++)
    {
      LCD->value = color;
    }  
}

